#include <stdio.h>
#include <locale.h>

int tsk1()
{
	printf("123\n"); // подзадание 1

	printf("1\n2\n3\n"); // подзадание 2

	printf("1\n\t2\n\t\t3\n"); // подзадание 3

	printf("%d\n%5d\n%9d\n%13d\n", 1,2,3,4); // подзадание 4

	printf("%10.3f\n ", 12.234657); // подзадание 5

	printf("%10.5f\n ", 12.234657); // подзадание 6

	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2); // подзадание 7

	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5); // подзадание 8
	printf("Умножение %d на %d равно %d\n ", 2000, 4, 2000 * 4); // подзадание 9

	printf("%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000); //подзадание 10
	printf("%d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000); //подзадание 10
	printf("%f разделить %f равно %f\n ", 5., 2000000., 5. / 2000000); //подзадание 10
	printf("%d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000); //подзадание 10
	return 0;
}

int tsk2() {
	int N, K;
	N = 15;
	K = 55;
	printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
	printf("Идёт %d минута суток\n", 60 * N + 55);
	printf("До плуночи осталось %d часов и %d минут\n", 24 - N, 60 - K);
	printf("С 8.00 прошло %d секунд\n", N * 3600 - 8 * 3600);
	printf("Текущий час = %.2f суток и текущая минута = %.2f часа\n", N / 24.0, K / 60.0);
	return 0;
}

int tsk3(){
	int n = 2;
	int L = 353;
	int k = 2;
	int m = 4;
	printf("var7\n");
	printf("Дано:\n\t%d\n\t%.d\n\t________\n", n, L);
	printf("Ответ:\n\t%+0*.*f\n", k+m+2,m,(n*1.0) / (L*1.0));
	return 0;
}

int main(){
	setlocale(LC_CTYPE, "RUS");
	tsk1();
	tsk2();
	tsk3();
	fun();
	return 0;
}